class Doctor {
  final String name;
  final String specialization;
  final double rating;

  Doctor(this.name, this.specialization, this.rating);
}

// قائمة الأطباء
final List<Doctor> doctors = [
  Doctor('أحمد', 'اكتئاب', 4.9),
  Doctor('ليلى', 'قلق', 4.7),
  Doctor('محمد', 'عدوانية', 4.8),
  Doctor('سارة', 'تقدير ذات', 4.6),
  Doctor('خالد', 'إدمان الإنترنت', 4.5),
  Doctor('نور', 'مشاكل اجتماعية', 4.9),
];

// خريطة التخصصات المرتبطة بالاختبارات
final Map<String, List<String>> testToSpecialization = {
  'test1': ['عدواني', 'عدائي', 'شرس', 'همجي', 'عنيف', 'متوحش', 'قاس', 'فظ', 'ضار', 'متسلط', 'جائر'],
  'test2': ['غضب', 'عدوانية', 'انفعالي', 'غيظ', 'هيجان', 'زعل', 'تذمر', 'انزعاج', 'توتر', 'عصبية'],
  'test3': ['غضب', 'عدوانية', 'انفعالي', 'غيظ', 'هيجان', 'زعل', 'تذمر', 'انزعاج', 'توتر', 'عصبية'],
  'test4': ['اكتئاب', 'حزن', 'قلق', 'احباط', 'كآبة', 'يأس', 'ضيق', 'إنكسار', 'تبلد', 'شجن', 'غم'],
  'test5': ['ذاتي', 'نفسي', 'تقدير', 'الثقة بالنفس', 'ثقة', 'قوة الشخصية', 'إحترام الذات', 'حب الذات', 'الوعي الذاتي', 'التقدير الذاتي', 'فخر', 'اعتزاز'],
  'test6': ['قلق', 'أقلق', 'توتر', 'اضطراب', 'خوف', 'هواجس', 'انزعاج', 'توجس', 'ارتياب', 'شك', 'عصبية', 'حيرة'],
  'test7': ['وحدة', 'لوحدي', 'لحالي', 'عزلة', 'اغتراب', 'انطواء', 'شعور بالفراغ', 'انفراد', 'انقطاع اجتماعي', 'ابتعاد عاطفي', 'وحشة'],
  'test8': ['احباط', 'محبط', 'إحباط', 'يأس', 'خيبة امل', 'كبت', 'تثبيط', 'خذلان', 'انكسار', 'إحباط نفسي', 'إنزعاج', 'فشل'],
  'test9': ['خوف اجتماعي', 'قلق اجتماعي', 'رهبة اجتماعية', 'توتر اجتماعي', 'اضطراب اجتماعي', 'خجل مفرط', 'انزعاج اجتماعي', 'عدم ارتياح اجتماعي', 'انطواء اجتماعي', 'حساسية مفرطة', 'تجنب المواقف الاجتماعية', 'حذر اجتماعي'],
  'test10': ['إحباط', 'يأس', 'تعب', 'قنوط', 'إحساس بعدم الجدوى', 'شعور بالعجز', 'فشل', 'حزن عميق', 'عدم التفاؤل', 'انخفاض في النشاط'],
  'test11': ['إدمان إنترنت', 'كثرة جلوس على الإنترنت', 'الإفراط في استخدام الإنترنت', 'تأثير سلبي على العلاقات الاجتماعية', 'اهتمام زائد بالإنترنت'],
  'test12': ['خجل', 'تردد', 'توتر اجتماعي', 'قلق اجتماعي', 'عدم ارتياح', 'انطواء', 'حساسية مفرطة', 'خوف من التقييم', 'تجنب التفاعلات الاجتماعية', 'قلق عند التواصل', 'عدم الراحة في المواقف الاجتماعية'],
  'test13': ['مسؤولية كبيرة', 'ضغوط نفسية', 'عبء إضافي', 'قلق دائم', 'توتر مستمر', 'تضحية', 'تعب عاطفي', 'إرهاق نفسي', 'تحديات يومية', 'خوف على المستقبل', 'شعور بالعجز'],
  'test14': ['رفض', 'تمرد', 'تحدي', 'مواجهة', 'عصيان', 'مخالفة', 'استقلالية مفرطة', 'تمسك بالرأي', 'تمسك بالأسلوب', 'إصرار', 'تحدي للسلطة', 'عدم الامتثال', 'ممانعة', 'تمرد ضد القواعد', 'عداء للسلطة', 'عدم احترام القوانين', 'مواجهة للضغوط', 'رفض للتوجيه', 'تشبث بالرأي الشخصي', 'عدم الاستجابة للأوامر'],
  'test15': ['نشيط للغاية', 'نشاط مفرط', 'تشتت الانتباه', 'صعوبة في التركيز', 'سلوك متهور', 'عدم الاستقرار', 'اندفاع', 'تململ', 'صعوبة في الجلوس لفترات طويلة', 'صعوبة في اتباع التعليمات', 'التصرفات غير المنتظمة', 'انفجارات عاطفية', 'عدم القدرة على إتمام المهام', 'سلوك غير متوقع', 'تبدلات مزاجية']
};
